name: COM0061 - Identificacion de rol con privilegios asignado a usuario
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/58055d89-3777-4599-9b25-b535c02e588b')]"
description: |-
  Identifica cuándo se asigna un nuevo rol privilegiado a un usuario.  Cualquier cuenta elegible para un rol está recibiendo acceso privilegiado. Si la asignación es inesperada o a un rol que no es responsabilidad del titular de la cuenta, investiga.

  Referencia : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#things-to-monitor-1
triggerOperator: GreaterThan
queryPeriod: P1D
enabled: true
queryFrequency: PT5H
tactics:
- CredentialAccess
triggerThreshold: 0
severity: High
query: |+
  // Define the start and end times based on input values
  let starttime = now() - 1h;
  let endtime = now();
  // Set a lookback period of 14 days
  let lookback = starttime - 14d;
  // Define a reusable function to query audit logs
  let awsFunc = (start: datetime, end: datetime) {
      AuditLogs
      | where TimeGenerated between (start .. end)
      | where Category =~ "RoleManagement"
      | where AADOperationType in ("Assign", "AssignEligibleRole")
      | where ActivityDisplayName has_any ("Add eligible member to role", "Add member to role")
      | mv-apply TargetResource = TargetResources on
          (
          where TargetResource.type in~ ("User", "ServicePrincipal")
          | extend
              Target = iff(TargetResource.type =~ "ServicePrincipal", tostring(TargetResource.displayName), tostring(TargetResource.userPrincipalName)),
              props = TargetResource.modifiedProperties
          )
      | mv-apply Property = props on
          (
          where Property.displayName =~ "Role.DisplayName"
          | extend RoleName = trim('"', tostring(Property.newValue))
          )
      | where RoleName contains "Admin" and Result == "success"
  };
  // Query for audit events in the current day
  let EventInfo_CurrentDay = awsFunc(starttime, endtime);
  // Query for audit events in the historical period (lookback)
  let EventInfo_historical = awsFunc(lookback, starttime);
  // Find unseen events by performing a left anti-join
  let EventInfo_Unseen = (EventInfo_CurrentDay
      | join kind=leftanti(EventInfo_historical) on Target, RoleName, OperationName
      );
  // Extend and clean up the results
  EventInfo_Unseen
  | extend InitiatingAppName = tostring(InitiatedBy.app.displayName)
  | extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)
  | extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)
  | extend InitiatingAadUserId = tostring(InitiatedBy.user.id)
  | extend InitiatingIpAddress = tostring(iff(isnotempty(InitiatedBy.user.ipAddress), InitiatedBy.user.ipAddress, InitiatedBy.app.ipAddress))
  | extend Initiator = iif(isnotempty(InitiatingAppName), InitiatingAppName, InitiatingUserPrincipalName)
  // You can uncomment the lines below to filter out PIM activations
  // | where Initiator != "MS-PIM"
  // | summarize StartTime=min(TimeGenerated), EndTime=min(TimeGenerated) by OperationName, RoleName, Target, Initiator, Result
  // Project specific columns and split them for further analysis
  //  | project Fecha = TimeGenerated, Accion = OperationName, RolAsignado = RoleName, Usuario = Target, Recurso= Initiator, ResultadoConexion = Result, InitiatingAppServicePrincipalId, InitiatingIpAddress
  //  | extend TargetName = tostring(split(Usuario,'@',0)[0]), TargetUPNSuffix = tostring(split(Usuario,'@',1)[0])
  | project
      Fecha = TimeGenerated,
      Accion= OperationName,
      RolAsignado = RoleName,
      Usuario= Target,
      Recurso = Initiator,
      InitiatingUserPrincipalName,
      InitiatingAadUserId,
      InitiatingAppName,
      InitiatingAppServicePrincipalId,
      InitiatingIpAddress,
      ResultadoConexion = Result
  | extend
      TargetName = tostring(split(Usuario, '@', 0)[0]),
      TargetUPNSuffix = tostring(split(Usuario, '@', 1)[0]),
      InitiatorName = tostring(split(InitiatingUserPrincipalName, '@', 0)[0]),
      InitiatorUPNSuffix = tostring(split(InitiatingUserPrincipalName, '@', 1)[0])
  | where TargetUPNSuffix !contains "PIDPIA.onmicrosoft.com"

techniques: []

