name: COM0076 - Acceso No Autorizado por Configuración de RBAC Incorrecta
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0e6d9a6e-225d-4561-83c7-c935c89b8972')]"
description: |-
  Este caso de uso tiene como objetivo detectar situaciones en las que un usuario obtiene privilegios elevados mediante una asignación de roles RBAC y los utiliza de forma inmediata para acceder a recursos críticos, lo que puede indicar una configuración incorrecta de permisos, abuso de privilegios o un compromiso de identidad.

  La detección se basa en la correlación temporal entre cambios en roles privilegiados y el uso efectivo de esos privilegios, concretamente el acceso a máquinas virtuales a través de Microsoft Azure Bastion.
triggerOperator: GreaterThan
queryPeriod: PT1H
enabled: true
queryFrequency: PT5M
tactics:
- CredentialAccess
- InitialAccess
triggerThreshold: 0
severity: High
query: |+
  AuditLogs
  | where TimeGenerated > ago(7d)
  | where ActivityDisplayName in ("Add member to role", "Add eligible member to role")
  | extend TargetUser = tostring(TargetResources[0].userPrincipalName),
           Role = tostring(parse_json(InitiatedBy.user).role),
           Actor = tostring(InitiatedBy.user.userPrincipalName),
           AssignmentTime = TimeGenerated
  | where Role has_any ("Global Administrator", "User Access Administrator", "Owner", "Contributor")
  | join kind=inner (
      MicrosoftAzureBastionAuditLogs
      | where TimeGenerated > ago(7d)
      | where OperationName == "StartSession"
      | extend AccessTime = TimeGenerated
      | extend User = coalesce(UserEmail, UserName)
  ) on $left.TargetUser == $right.User
  | where AccessTime between (AssignmentTime .. AssignmentTime + 6h)
  | project AssignmentTime, AccessTime, TargetUser, Role, Actor, ClientIpAddress, TargetVMIPAddress, Protocol
  | order by AccessTime desc

techniques: []

