severity: Medium
name: '[SEGITTUR] Alerta Defender for Cloud'
enabled: true
triggerOperator: GreaterThan
query: |+
  SecurityAlert
  | where ProductName == "Azure Security Center"
  | extend Principal_IP_ = tostring(parse_json(ExtendedProperties).["Principal IP"])
  | extend Malicious_URL_ = tostring(parse_json(ExtendedProperties).["Malicious URL"])
  | where Malicious_URL_ !contains "example.com"
  | summarize
      Message=make_set(ProviderName),
      startTime=min(TimeGenerated),
      endTime=max(TimeGenerated),
      EventCount = count()
      by AlertName, Principal_IP_

tactics: []
triggerThreshold: 0
queryFrequency: PT10M
queryPeriod: PT1H
techniques: []
description: '[SEGITTUR] Alerta Defender for Cloud'
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/13cba58e-2d7b-46d3-8f24-d6211b6f8066')]"

