{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "resources": [
    {
      "type": "Microsoft.SecurityInsights/alertRules",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspaceName'),'/',System.Collections.Hashtable.id)]",
      "properties": {
        "description": "PIM proporciona un mecanismo clave para asignar privilegios a las cuentas, esta consulta detecta cambios en la configuración de roles de PIM. Supervisa estos cambios para asegurarte de que se realizan de forma legítima y no confieren más privilegios de los esperados ni reducen la seguridad de una elevación de PIM.\n\nReferencia: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#changes-to-privileged-accounts",
        "triggerOperator": "GreaterThan",
        "enabled": true,
        "queryFrequency": "PT5M",
        "queryPeriod": "PT1H",
        "query": " AuditLogs\n    | where Category =~ \"RoleManagement\"\n    | where OperationName =~ \"Update role setting in PIM\"\n    | extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)\n    | extend InitiatingAadUserId = tostring(InitiatedBy.user.id)\n    | extend InitiatingIPAddress = tostring(InitiatedBy.user.ipAddress)\n    | extend InitiatingAccountName = tostring(split(InitiatingUserPrincipalName, \"@\")[0]), InitiatingAccountUPNSuffix = tostring(split(InitiatingUserPrincipalName, \"@\")[1])\n    | project-reorder TimeGenerated, OperationName, ResultReason, InitiatingUserPrincipalName, InitiatingAadUserId, InitiatingIPAddress, InitiatingAccountName, InitiatingAccountUPNSuffix\n",
        "severity": "High",
        "tactics": [
          "PrivilegeEscalation"
        ],
        "techniques": [],
        "displayName": "COM0064 - Cambios en la configuracion de Privileged Identity Management (PIM)",
        "triggerThreshold": 0
      },
      "apiVersion": "2022-12-01-preview"
    }
  ],
  "parameters": {
    "workspaceName": {
      "type": "string"
    }
  },
  "contentVersion": "1.0.0.0"
}
