{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "resources": [
    {
      "type": "Microsoft.SecurityInsights/alertRules",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspaceName'),'/',System.Collections.Hashtable.id)]",
      "properties": {
        "description": "Identifica cuándo se asigna un nuevo rol privilegiado a un usuario.  Cualquier cuenta elegible para un rol está recibiendo acceso privilegiado. Si la asignación es inesperada o a un rol que no es responsabilidad del titular de la cuenta, investiga.\n\nReferencia : https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#things-to-monitor-1",
        "triggerOperator": "GreaterThan",
        "enabled": true,
        "queryFrequency": "PT5H",
        "queryPeriod": "P1D",
        "query": "// Define the start and end times based on input values\nlet starttime = now() - 1h;\nlet endtime = now();\n// Set a lookback period of 14 days\nlet lookback = starttime - 14d;\n// Define a reusable function to query audit logs\nlet awsFunc = (start: datetime, end: datetime) {\n    AuditLogs\n    | where TimeGenerated between (start .. end)\n    | where Category =~ \"RoleManagement\"\n    | where AADOperationType in (\"Assign\", \"AssignEligibleRole\")\n    | where ActivityDisplayName has_any (\"Add eligible member to role\", \"Add member to role\")\n    | mv-apply TargetResource = TargetResources on\n        (\n        where TargetResource.type in~ (\"User\", \"ServicePrincipal\")\n        | extend\n            Target = iff(TargetResource.type =~ \"ServicePrincipal\", tostring(TargetResource.displayName), tostring(TargetResource.userPrincipalName)),\n            props = TargetResource.modifiedProperties\n        )\n    | mv-apply Property = props on\n        (\n        where Property.displayName =~ \"Role.DisplayName\"\n        | extend RoleName = trim('\"', tostring(Property.newValue))\n        )\n    | where RoleName contains \"Admin\" and Result == \"success\"\n};\n// Query for audit events in the current day\nlet EventInfo_CurrentDay = awsFunc(starttime, endtime);\n// Query for audit events in the historical period (lookback)\nlet EventInfo_historical = awsFunc(lookback, starttime);\n// Find unseen events by performing a left anti-join\nlet EventInfo_Unseen = (EventInfo_CurrentDay\n    | join kind=leftanti(EventInfo_historical) on Target, RoleName, OperationName\n    );\n// Extend and clean up the results\nEventInfo_Unseen\n| extend InitiatingAppName = tostring(InitiatedBy.app.displayName)\n| extend InitiatingAppServicePrincipalId = tostring(InitiatedBy.app.servicePrincipalId)\n| extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)\n| extend InitiatingAadUserId = tostring(InitiatedBy.user.id)\n| extend InitiatingIpAddress = tostring(iff(isnotempty(InitiatedBy.user.ipAddress), InitiatedBy.user.ipAddress, InitiatedBy.app.ipAddress))\n| extend Initiator = iif(isnotempty(InitiatingAppName), InitiatingAppName, InitiatingUserPrincipalName)\n// You can uncomment the lines below to filter out PIM activations\n// | where Initiator != \"MS-PIM\"\n// | summarize StartTime=min(TimeGenerated), EndTime=min(TimeGenerated) by OperationName, RoleName, Target, Initiator, Result\n// Project specific columns and split them for further analysis\n//  | project Fecha = TimeGenerated, Accion = OperationName, RolAsignado = RoleName, Usuario = Target, Recurso= Initiator, ResultadoConexion = Result, InitiatingAppServicePrincipalId, InitiatingIpAddress\n//  | extend TargetName = tostring(split(Usuario,'@',0)[0]), TargetUPNSuffix = tostring(split(Usuario,'@',1)[0])\n| project\n    Fecha = TimeGenerated,\n    Accion= OperationName,\n    RolAsignado = RoleName,\n    Usuario= Target,\n    Recurso = Initiator,\n    InitiatingUserPrincipalName,\n    InitiatingAadUserId,\n    InitiatingAppName,\n    InitiatingAppServicePrincipalId,\n    InitiatingIpAddress,\n    ResultadoConexion = Result\n| extend\n    TargetName = tostring(split(Usuario, '@', 0)[0]),\n    TargetUPNSuffix = tostring(split(Usuario, '@', 1)[0]),\n    InitiatorName = tostring(split(InitiatingUserPrincipalName, '@', 0)[0]),\n    InitiatorUPNSuffix = tostring(split(InitiatingUserPrincipalName, '@', 1)[0])\n| where TargetUPNSuffix !contains \"PIDPIA.onmicrosoft.com\"\n\n",
        "severity": "High",
        "tactics": [
          "CredentialAccess"
        ],
        "techniques": [],
        "displayName": "COM0061 - Identificacion de rol con privilegios asignado a usuario",
        "triggerThreshold": 0
      },
      "apiVersion": "2022-12-01-preview"
    }
  ],
  "parameters": {
    "workspaceName": {
      "type": "string"
    }
  },
  "contentVersion": "1.0.0.0"
}
