{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "resources": [
    {
      "type": "Microsoft.SecurityInsights/alertRules",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspaceName'),'/',System.Collections.Hashtable.id)]",
      "properties": {
        "description": "Identifica los inicios de sesión fallidos de usuarios de gran volumen y el resultado debe analizarse para determinar si se trata de un ataque dirigido o simplemente de un error al introducir la contraseña.",
        "triggerOperator": "GreaterThan",
        "enabled": true,
        "queryFrequency": "PT5M",
        "queryPeriod": "PT1H",
        "query": "SigninLogs\r\n| where ResultType == 50126\r\n| extend Country = tostring(LocationDetails[\"countryOrRegion\"])\r\n| project\r\n    TimeGenerated,\r\n    UserPrincipalName,\r\n    AppDisplayName,\r\n    IPAddress,\r\n    Country,\r\n    AuthenticationDetails,\r\n    DeviceDetail\r\n//| summarize by UserPrincipalName, IPAddress,AuthenticationDetails,Country\r\n| top 5 by UserPrincipalName\r\n| order by UserPrincipalName desc ",
        "severity": "Low",
        "tactics": [
          "CredentialAccess"
        ],
        "techniques": [],
        "displayName": "COM0062 - Intentos de inicio de sesion fallidos detectados",
        "triggerThreshold": 200
      },
      "apiVersion": "2022-12-01-preview"
    }
  ],
  "parameters": {
    "workspaceName": {
      "type": "string"
    }
  },
  "contentVersion": "1.0.0.0"
}
