{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "resources": [
    {
      "type": "Microsoft.SecurityInsights/alertRules",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspaceName'),'/',System.Collections.Hashtable.id)]",
      "properties": {
        "description": "[SEGITTUR] Alerta Defender for Cloud",
        "triggerOperator": "GreaterThan",
        "enabled": true,
        "queryFrequency": "PT10M",
        "queryPeriod": "PT1H",
        "query": "SecurityAlert\n| where ProductName == \"Azure Security Center\"\n| extend Principal_IP_ = tostring(parse_json(ExtendedProperties).[\"Principal IP\"])\n| extend Malicious_URL_ = tostring(parse_json(ExtendedProperties).[\"Malicious URL\"])\n| where Malicious_URL_ !contains \"example.com\"\n| summarize\n    Message=make_set(ProviderName),\n    startTime=min(TimeGenerated),\n    endTime=max(TimeGenerated),\n    EventCount = count()\n    by AlertName, Principal_IP_\n\n",
        "severity": "Medium",
        "tactics": [],
        "techniques": [],
        "displayName": "[SEGITTUR] Alerta Defender for Cloud",
        "triggerThreshold": 0
      },
      "apiVersion": "2022-12-01-preview"
    }
  ],
  "parameters": {
    "workspaceName": {
      "type": "string"
    }
  },
  "contentVersion": "1.0.0.0"
}
