{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "resources": [
    {
      "type": "Microsoft.SecurityInsights/alertRules",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspaceName'),'/',System.Collections.Hashtable.id)]",
      "properties": {
        "description": "This use case searches for failed sign-in attempts to disabled accounts summarized by the IP originating IP address.",
        "triggerOperator": "GreaterThan",
        "enabled": true,
        "queryFrequency": "PT1H",
        "queryPeriod": "PT1H",
        "query": "SigninLogs \n  | where ResultType == \"50057\" \n  | where ResultDescription =~ \"User account is disabled. The account has been disabled by an administrator.\" \n  | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), numberAccountsTargeted = dcount(UserPrincipalName), \n  numberApplicationsTargeted = dcount(AppDisplayName), accountSet = make_set(UserPrincipalName, 100), applicationSet=make_set(AppDisplayName, 100), \n  numberLoginAttempts = count() by IPAddress\n  | extend timestamp = StartTime\n  | order by numberLoginAttempts desc\n  | extend IP_0_Address = IPAddress",
        "severity": "Low",
        "tactics": [
          "InitialAccess"
        ],
        "techniques": [
          "T1078"
        ],
        "displayName": "[TEST]IA-AD-00X-T1078 Detect Disabled Account Sign-in Attempts by IP Address",
        "triggerThreshold": 0
      },
      "apiVersion": "2022-12-01-preview"
    }
  ],
  "parameters": {
    "workspaceName": {
      "type": "string"
    }
  },
  "contentVersion": "1.0.0.0"
}
