{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0e6d9a6e-225d-4561-83c7-c935c89b8972')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0e6d9a6e-225d-4561-83c7-c935c89b8972')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "AUTO DISABLED COM0076 - Acceso No Autorizado por Configuración de RBAC Incorrecta",
                "description": "The alert rule was disabled due to too many consecutive failures. Reason: This rule was automatically disabled due to insufficient permissions. The rule requires permissions which are different from those held by the user who created the rule at the time of rule creation. This often happens due to changes in functions used or references to external data. Please edit and re-save the rule with a user that can execute the query in it. For troubleshooting guidance, see: https://aka.ms/AnalyticsAutoDisabledRules Este caso de uso tiene como objetivo detectar situaciones en las que un usuario obtiene privilegios elevados mediante una asignación de roles RBAC y los utiliza de forma inmediata para acceder a recursos críticos, lo que puede indicar una configuración incorrecta de permisos, abuso de privilegios o un compromiso de identidad.\n\nLa detección se basa en la correlación temporal entre cambios en roles privilegiados y el uso efectivo de esos privilegios, concretamente el acceso a máquinas virtuales a través de Microsoft Azure Bastion.",
                "severity": "High",
                "enabled": false,
                "query": "AuditLogs\n| where TimeGenerated > ago(7d)\n| where ActivityDisplayName in (\"Add member to role\", \"Add eligible member to role\")\n| extend TargetUser = tostring(TargetResources[0].userPrincipalName),\n         Role = tostring(parse_json(InitiatedBy.user).role),\n         Actor = tostring(InitiatedBy.user.userPrincipalName),\n         AssignmentTime = TimeGenerated\n| where Role has_any (\"Global Administrator\", \"User Access Administrator\", \"Owner\", \"Contributor\")\n| join kind=inner (\n    MicrosoftAzureBastionAuditLogs\n    | where TimeGenerated > ago(7d)\n    | where OperationName == \"StartSession\"\n    | extend AccessTime = TimeGenerated\n    | extend User = coalesce(UserEmail, UserName)\n) on $left.TargetUser == $right.User\n| where AccessTime between (AssignmentTime .. AssignmentTime + 6h)\n| project AssignmentTime, AccessTime, TargetUser, Role, Actor, ClientIpAddress, TargetVMIPAddress, Protocol\n| order by AccessTime desc\n\n",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "CredentialAccess",
                    "InitialAccess"
                ],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": true,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account",
                            "Host",
                            "IP"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": [
                            "HoraAsignacion",
                            "HoraAcceso",
                            "UsuarioDestino",
                            "Rol",
                            "Actor",
                            "IPVMDestino",
                            "IPAddress"
                        ]
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": {
                    "HoraAsignacion": "AssignmentTime",
                    "HoraAcceso": "AccessTime",
                    "UsuarioDestino": "TargetUser",
                    "Rol": "Role",
                    "Actor": "Actor",
                    "IPAddress": "ClientIpAddress",
                    "IPVMDestino": "TargetVMIPAddress"
                },
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "PUID",
                                "columnName": "AssignmentTime"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "PUID",
                                "columnName": "AccessTime"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "TargetUser"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Role"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Actor"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "ClientIpAddress"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "TargetVMIPAddress"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "Protocol"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}