{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8c2cbff9-5d03-479f-b074-08c34e5fa065')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8c2cbff9-5d03-479f-b074-08c34e5fa065')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "AUTO DISABLED REC0028 - Uso de Redes Virtuales Peering sin Restricciones",
                "description": "The alert rule was disabled due to too many consecutive failures. Reason: This rule was automatically disabled due to insufficient permissions. The rule requires permissions which are different from those held by the user who created the rule at the time of rule creation. This often happens due to changes in functions used or references to external data. Please edit and re-save the rule with a user that can execute the query in it. For troubleshooting guidance, see: https://aka.ms/AnalyticsAutoDisabledRules Este caso de uso detecta configuraciones de VNet Peering potencialmente permisivas que pueden introducir riesgos de exposición o tránsito de tráfico no deseado entre redes virtuales. En concreto, identifica peerings creados o modificados con las siguientes opciones habilitadas simultáneamente:\n\nallowVirtualNetworkAccess = true\n\nallowForwardedTraffic = true\n\nEsta combinación permite conectividad bidireccional ampliada y tránsito de tráfico reenviado, lo que incrementa el riesgo de movimiento lateral entre VNets, rutas no previstas y una expansión del perímetro de confianza.\n\nAdicionalmente, la detección identifica si el peering remoto está asociado a Azure Bastion, con el objetivo de priorizar la revisión de configuraciones que puedan ampliar indirectamente el acceso administrativo.\n\nLa búsqueda se ejecutará cada 5 minutos teniendo en cuenta la última hora.",
                "severity": "High",
                "enabled": false,
                "query": "AzureActivity\n| where TimeGenerated > ago(30d)\n| where OperationNameValue == \"Microsoft.Network / virtualNetworks / virtualNetworkPeerings / write\"\n| extend properties = parse_json(Properties)\n| extend peeringProps = properties.responseBody.properties\n| extend allowVNetAccess = tostring(peeringProps.allowVirtualNetworkAccess)\n| extend allowForwardedTraffic = tostring(peeringProps.allowForwardedTraffic)\n| extend peeringRemoteVNet = tostring(peeringProps.remoteVirtualNetwork.id)\n| extend peeredToBastion = iff(peeringRemoteVNet has \"Microsoft.Network / bastionHosts\", \"Yes\", \"No\")\n| where allowVNetAccess == \"true\" and allowForwardedTraffic == \"true\"\n| project\n    TimeGenerated,\n    ResourceGroup,\n    ResourceId,\n    Caller,\n    peeringRemoteVNet,\n    peeredToBastion,\n    allowVNetAccess,\n    allowForwardedTraffic",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "Discovery",
                    "Reconnaissance"
                ],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account",
                            "IP",
                            "Host"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": [
                            "Fecha",
                            "GrupoRecursos",
                            "IDrecursos",
                            "RedPrivadaRemotaVNET",
                            "EmparejadaBastion",
                            "PermitirAccesoVNet",
                            "PermitirTraficoReenv"
                        ]
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": {
                    "Fecha": "TimeGenerated",
                    "GrupoRecursos": "ResourceGroup",
                    "IDrecursos": "ResourceId",
                    "Usuario_Servicio": "Caller",
                    "RedPrivadaRemotaVNET": "peeringRemoteVNet",
                    "EmparejadaBastion": "peeredToBastion",
                    "PermitirAccesoVNet": "allowVNetAccess",
                    "PermitirTraficoReenv": "allowForwardedTraffic"
                },
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "ResourceGroup"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Sid",
                                "columnName": "ResourceId"
                            }
                        ]
                    },
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "FullName",
                                "columnName": "Caller"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "peeringRemoteVNet"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "peeredToBastion"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "allowVNetAccess"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "allowForwardedTraffic"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}