description: Se detectan varios eventos de criticidad media en un host en 1 hora.
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e9a1b3bb-6633-4ccb-af17-7f881c5dca94')]"
query: |-
  //Modifica nombre de la alerta, por la alerta a excluir
  let watchlist_EX_AV_052_RuleException = _GetWatchlist('watchlist_EX_AV_052_RuleException') | project SearchKey;
  SecurityAlert
  | where ProviderName == 'MDATP'
  | where AlertSeverity == 'Medium'
  | where Status == 'New'
  | where AlertName !in (watchlist_EX_AV_052_RuleException)
  | summarize count() by CompromisedEntity
  | where count_ >= 4
  | join kind=inner (SecurityAlert
      | where ProviderName == 'MDATP'
      | where AlertSeverity == 'Medium'
      | where Status == 'New')
      on CompromisedEntity
  //| lookup kind=leftouter _GetWatchlist('watchlist_Device_Asset_Inventory') on $left.CompromisedEntity == $right.Host
  | project TimeGenerated, EventCount = count_, EventType = DisplayName, ThreatName = AlertName, ThreatRef = AlertType, DvcHostname = CompromisedEntity, EventMessage = Description, EventVendor = VendorName, EventProduct = ProviderName, EventReportUrl = AlertLink, EventOriginalUid = VendorOriginalId, ConfidenceScore, IsIncident, EventStartTime = StartTime, EventEndTime = EndTime, Entities, DvcAction = Status, Tactics, Techniques, SubTechniques, ExtendedProperties
queryFrequency: PT1H
severity: Low
queryPeriod: PT1H
name: '[GEN][MIN][MDATP] EX-AV-052-1204.002 Incidente múltiple de criticidad MEDIA'
triggerOperator: GreaterThan
enabled: true
triggerThreshold: 0
techniques:
- T1204
tactics:
- Execution

