queryFrequency: PT5M
tactics:
- Execution
triggerOperator: GreaterThan
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8a5dd427-2634-47dc-87dd-986bc201b48f')]"
enabled: true
description: Se detecta un evento de criticidad crítica en un host.
severity: High
queryPeriod: PT5M
query: |-
  //Modifica nombre de la alerta, por la alerta a excluir
  let watchlist_EX_AV_050_RuleException = _GetWatchlist('watchlist_EX_AV_050_RuleException') | project SearchKey;
  SecurityAlert
  | where ProviderName == 'MDATP'
  | where AlertSeverity == 'High'
  | where Status == 'New'
  | where AlertName !in (watchlist_EX_AV_050_RuleException)
  | summarize count() by CompromisedEntity
  | where count_ >= 1
  | join kind=inner (SecurityAlert
      | where ProviderName == 'MDATP'
      | where AlertSeverity == 'High'
      | where Status == 'New')
      on CompromisedEntity
  //| lookup kind=leftouter _GetWatchlist('watchlist_Device_Asset_Inventory') on $left.CompromisedEntity == $right.Host
  | project TimeGenerated, EventCount = count_, EventType = DisplayName, ThreatName = AlertName, ThreatRef = AlertType, DvcHostname = CompromisedEntity, EventMessage = Description, EventVendor = VendorName, EventProduct = ProviderName, EventReportUrl = AlertLink, EventOriginalUid = VendorOriginalId, ConfidenceScore, IsIncident, EventStartTime = StartTime, EventEndTime = EndTime, Entities, DvcAction = Status, Tactics, Techniques, SubTechniques, ExtendedProperties
techniques:
- T1204
name: '[GEN][MIN][MDATP] EX-AV-050-1204.002 Incidente CRÍTICO'
triggerThreshold: 0

