queryFrequency: PT1H
tactics:
- Persistence
triggerOperator: GreaterThan
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/7cd23750-72b5-42aa-9ba5-9caee4c12edd')]"
enabled: true
description: Busca secret expirado en el Service Principal de la integración usada por XSOAR, no genera incidente en la plataforma de TTECH, ya que la integración con nuestro entorno usa esta plataforma.
severity: High
queryPeriod: P1D
query: |-
  AADServicePrincipalSignInLogs
  | where TimeGenerated > ago(1d)
  //Modificar para CDU personalizados, donde el nombre no se puede modificar
  | where ServicePrincipalName == "app-pid-pre-spn-xsoar-001"
  | summarize
      ['All Error Codes']=make_set(ResultType),
      ['Successful IP Addresses']=make_set_if(IPAddress, ResultType == 0),
      ['Failed IP Addresses']=make_set_if(IPAddress, ResultType == "7000222")
      by ServicePrincipalId, ServicePrincipalName
  | where ['All Error Codes'] has_all ("0", "7000222")
  | project TargetAppId = ServicePrincipalId, TargetAppName = ServicePrincipalName, EventResult = ['All Error Codes'], EventFailedIp = ['Failed IP Addresses'], EventSuccessIp = ['Successful IP Addresses']
techniques:
- T1098
name: '[GEN][MIN] AS-SNTL-040 Detectado secret expirado en integración XSOAR'
triggerThreshold: 0

