queryFrequency: PT5H
tactics:
- InitialAccess
- CommandAndControl
triggerOperator: GreaterThan
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e478ec09-12a0-4fcd-9ab4-c2e8a31da66a')]"
enabled: true
description: '[SEGITTUR] TIP - Conexion entrante aceptada WAF contra IP'
severity: High
queryPeriod: P1D
query: |-
  let ThreatIPs = ThreatIntelIndicators
  | where isnotempty(ObservableValue)
  | where IsDeleted == false;
  //| where Confidence >= 20;
  AzureDiagnostics
  | where Category == "FrontDoorWebApplicationFirewallLog"
  | where ResourceType in ("FRONTDOORS", "PROFILES")
  | where action_s != "Block"
  | where requestUri_s contains "pid.segittur"
  | where isnotempty(clientIP_s)
  | join kind=inner (
      ThreatIPs
  ) on $left.clientIP_s == $right.ObservableValue
  | project TimeGenerated,
            clientIP_s,
            requestUri_s,
            action_s,
            ObservableValue,
            Confidence,
            ResourceType,
            Created,
            ValidUntil
techniques:
- T1190
- T1071
name: '[SEGITTUR] TIP - Conexion entrante aceptada WAF contra IP'
triggerThreshold: 0

