description: This use case searches for failed sign-in attempts to disabled accounts summarized by the IP originating IP address.
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9b30cf78-ae05-4ef1-9917-f01e83b0ae04')]"
query: |-
  SigninLogs 
    | where ResultType == "50057" 
    | where ResultDescription =~ "User account is disabled. The account has been disabled by an administrator." 
    | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated), numberAccountsTargeted = dcount(UserPrincipalName), 
    numberApplicationsTargeted = dcount(AppDisplayName), accountSet = make_set(UserPrincipalName, 100), applicationSet=make_set(AppDisplayName, 100), 
    numberLoginAttempts = count() by IPAddress
    | extend timestamp = StartTime
    | order by numberLoginAttempts desc
    | extend IP_0_Address = IPAddress
queryFrequency: PT1H
severity: Low
queryPeriod: PT1H
name: '[TEST]IA-AD-00X-T1078 Detect Disabled Account Sign-in Attempts by IP Address'
triggerOperator: GreaterThan
enabled: true
triggerThreshold: 0
techniques:
- T1078
tactics:
- InitialAccess

