queryFrequency: PT1H
tactics:
- Persistence
triggerOperator: GreaterThan
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/c46366c5-897a-41a5-b462-49ff474f0897')]"
enabled: true
description: Detecta miembro añadido a un grupo sensible definido en watchlist.
severity: Low
queryPeriod: PT1H
query: |-
  let watchlist_PR_CLD_031_032_Group = (_GetWatchlist("watchlist_PR_CLD_031_032_Group") | project SearchKey);
  AuditLogs
  | where OperationName == "Add member to group"
  | extend ActorUsername = tostring(InitiatedBy.user.userPrincipalName)
  | where isnotempty(ActorUsername)
  | extend GroupName = tostring((TargetResources[0].modifiedProperties)[1].newValue)
  | where GroupName in~ (watchlist_PR_CLD_031_032_Group) // Grupos sensibles, modificar whatchlist
  | extend AddUser = tostring(TargetResources[0].userPrincipalName)
  | extend AddUserId = tostring((TargetResources[0].modifiedProperties)[0].newValue)
  | extend ActorUsername = tostring(InitiatedBy.user.userPrincipalName)
  | where isnotempty(ActorUsername)
  | project TimeGenerated, TargetUsername = AddUser, TargetUserScopeId = AddUserId, GroupName, ActorUsername
techniques:
- T1078
name: '[TEST] PR-CLD-032-T1078.004 Miembro añadido a grupo sensible'
triggerThreshold: 0

