description: Detects when a user performs a massive download of data from OneDrive and/or SharePoint, 1000 files in 10 minutes. Provides data on Country, Client IP, and all downloaded files.
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/49117014-ad9a-47ab-a02f-3a353abb2d19')]"
query: |-
  let watchlist_EF_O365_002_T1048_User = (_GetWatchlist('watchlist_EF_O365_002_T1048_User') 
      | project SearchKey); 
  let watchlist_EF_O365_002_T1048_SourceIP = (_GetWatchlist('watchlist_EF_O365_002_T1048_SourceIP')
      | project SearchKey); 
  OfficeActivity 
  | where OfficeWorkload in ("SharePoint", "OneDrive") 
  | where Operation == "FileDownloaded" 
  //| extend usuario = tostring(split(UserId,'@'))
  // Se excepciona sincronizaciones mismo usuario
  | extend user = replace_regex(UserId, "[.@]", "_")
  | where Site_Url !has user
  | where ClientIP !in (watchlist_EF_O365_002_T1048_SourceIP) 
  | where UserId !in (watchlist_EF_O365_002_T1048_User) 
  | extend location1=geo_info_from_ip_address(ClientIP)
  | extend Country = tostring(parse_json(tostring(location1)).country)
  | summarize dcount(OfficeObjectId) by UserId, OfficeWorkload, Site_Url 
  | where dcount_OfficeObjectId > 500
  | join kind=inner (OfficeActivity 
      | where OfficeWorkload in ("SharePoint", "OneDrive") 
      | where Operation == "FileDownloaded" 
      | where ClientIP !in (watchlist_EF_O365_002_T1048_SourceIP) 
      | where UserId !in (watchlist_EF_O365_002_T1048_User)
      | extend location1=geo_info_from_ip_address(ClientIP)
      | extend Country = tostring(parse_json(tostring(location1)).country)
      ) 
      on UserId 
  | project 
      ActorUsername = UserId, 
      ActingAppName = OfficeWorkload, 
      TargetUrl = Site_Url, 
      Operation, 
      SrcIpAddr = ClientIP,
      SrcGeoCountry = Country,
      HttpUserAgent = UserAgent, 
      SrcFileName = SourceFileName, 
      EventCount = dcount_OfficeObjectId
  | parse ActorUsername with * "urn:spo:" UserUPN
  | extend User = iff(isempty(UserUPN), ActorUsername, UserUPN)
  | project-away UserUPN
  | summarize arg_max(TargetUrl,Operation,HttpUserAgent,SrcGeoCountry,EventCount),ListObject = make_set(SrcFileName) by ActorUsername, SrcIpAddr, ActingAppName
queryFrequency: PT10M
severity: Low
queryPeriod: PT10M
name: '[TEST][GEN] EF-O365-002-T1048 Massive data download from SharePoint/OneDrive'
triggerOperator: GreaterThan
enabled: false
triggerThreshold: 0
techniques:
- T1048
tactics:
- Exfiltration

