{
  "parameters": {
    "workspaceName": {
      "type": "string"
    }
  },
  "resources": [
    {
      "name": "[concat(parameters('workspaceName'),'/',System.Collections.Hashtable.id)]",
      "type": "Microsoft.SecurityInsights/alertRules",
      "kind": "Scheduled",
      "properties": {
        "query": "AADServicePrincipalSignInLogs\n| where TimeGenerated > ago(1d)\n//Modificar para CDU personalizados, donde el nombre no se puede modificar\n| where ServicePrincipalName == \"app-pid-pre-spn-xsoar-001\"\n| summarize\n    ['All Error Codes']=make_set(ResultType),\n    ['Successful IP Addresses']=make_set_if(IPAddress, ResultType == 0),\n    ['Failed IP Addresses']=make_set_if(IPAddress, ResultType == \"7000222\")\n    by ServicePrincipalId, ServicePrincipalName\n| where ['All Error Codes'] has_all (\"0\", \"7000222\")\n| project TargetAppId = ServicePrincipalId, TargetAppName = ServicePrincipalName, EventResult = ['All Error Codes'], EventFailedIp = ['Failed IP Addresses'], EventSuccessIp = ['Successful IP Addresses']",
        "severity": "High",
        "queryFrequency": "PT1H",
        "description": "Busca secret expirado en el Service Principal de la integración usada por XSOAR, no genera incidente en la plataforma de TTECH, ya que la integración con nuestro entorno usa esta plataforma.",
        "triggerThreshold": 0,
        "enabled": true,
        "triggerOperator": "GreaterThan",
        "tactics": [
          "Persistence"
        ],
        "queryPeriod": "P1D",
        "techniques": [
          "T1098"
        ],
        "displayName": "[GEN][MIN] AS-SNTL-040 Detectado secret expirado en integración XSOAR"
      },
      "apiVersion": "2022-12-01-preview"
    }
  ],
  "contentVersion": "1.0.0.0",
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
}
