{
  "parameters": {
    "workspaceName": {
      "type": "string"
    }
  },
  "resources": [
    {
      "name": "[concat(parameters('workspaceName'),'/',System.Collections.Hashtable.id)]",
      "type": "Microsoft.SecurityInsights/alertRules",
      "kind": "Scheduled",
      "properties": {
        "query": "AuditLogs\n| where OperationName == \"Add user\" and Identity == \"Microsoft B2B Admin Worker\"\n| project\nUser = TargetResources[0].modifiedProperties[5].newValue,\nAdm = InitiatedBy['user'].userPrincipalName,\nIPOrigen = InitiatedBy['user'].ipAddress\n| where Adm != \"luis.coca@mn8energy.com\"\n| where Adm != \"jaime.moreno.ext@mn8energy.com\"\n| where Adm != \"jaime.garcia.ext@mn8energy.com\"\n| where Adm != \"carlosandres.bejarano.ext@mn8energy.com\"\n\n\n",
        "severity": "Informational",
        "queryFrequency": "PT1H",
        "description": "La consulta de ejemplo siguiente crea una alerta si se agrega un usuario invitado a Azure AD. En algunos entornos esto podría y debería desencadenar una alerta, en otros entornos esto sucede continuamente y no debe usarse (para reducir el ruido).",
        "triggerThreshold": 0,
        "enabled": true,
        "triggerOperator": "GreaterThan",
        "tactics": [
          "Persistence"
        ],
        "queryPeriod": "PT1H",
        "techniques": [
          "T1136",
          "T1078"
        ],
        "displayName": "[TEST]PR-CLD-019-T1136.003 Guest account added to Azure AD"
      },
      "apiVersion": "2022-12-01-preview"
    }
  ],
  "contentVersion": "1.0.0.0",
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#"
}
