{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0",
  "parameters": {},
  "variables": {},
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/savedSearches",
      "apiVersion": "2022-10-01",
      "name": "Microsoft_Defender_XDR_Hunting_Query_229",
      "location": "",
      "properties": {
        "eTag": "*",
        "displayName": "Admin Submissions by Grading verdict (FN-FP)",
        "category": "Hunting Queries",
        "query": "CloudAppEvents\n| where ActionType contains \"AdminSubmissionTriage\"\n| extend UserKey = (parse_json(RawEventData)).UserKey, SubmissionState = (parse_json(RawEventData)).SubmissionState,  SubmissionId=(parse_json(RawEventData)).SubmissionId, TriageVerdict=(parse_json(RawEventData)).GradingResult.TriageVerdict\n| summarize count() by tostring(TriageVerdict)\n| render piechart\n",
        "version": 2,
        "tags": [
          {
            "name": "description",
            "value": "This query visualises the total amount of admin false negative or false positive submissions by the verdict of the submission grading."
          },
          {
            "name": "tactics",
            "value": "InitialAccess"
          },
          {
            "name": "techniques",
            "value": "T1566"
          }
        ]
      }
    },
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/metadata",
      "apiVersion": "2022-01-01-preview",
      "name": "log-sentinel-segittur-015/Microsoft.SecurityInsights/HuntingQuery-8425234b-f09d-490e-be3d-a7ecf081c5d0",
      "properties": {
        "description": "Microsoft Defender XDR Hunting Query 229",
        "parentId": "/subscriptions/00d393de-162e-4a44-9005-3c829e7c070a/resourceGroups/RG-log-sentinel-segittur-015/providers/Microsoft.OperationalInsights/savedSearches/8425234b-f09d-490e-be3d-a7ecf081c5d0",
        "contentId": "8425234b-f09d-490e-be3d-a7ecf081c5d0",
        "kind": "HuntingQuery",
        "version": "1.0.0",
        "source": {
          "kind": "Solution",
          "name": "Microsoft Defender XDR",
          "sourceId": "azuresentinel.azure-sentinel-solution-microsoft365defender"
        },
        "author": {
          "name": "Microsoft",
          "email": "support@microsoft.com"
        },
        "support": {
          "name": "Microsoft Corporation",
          "email": "support@microsoft.com",
          "tier": "Microsoft",
          "link": "https://support.microsoft.com"
        }
      }
    }
  ]
}
