{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9c968fc7-3e9c-402d-ba87-06d2306a2d1e')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9c968fc7-3e9c-402d-ba87-06d2306a2d1e')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "[GEN][MIN] AS-SNTL-040 Expired secret detected in XSOAR integration",
                "description": "Search for expired secrets in the Service Principal of the integration used by XSOAR. This does not generate an incident in the TTECH platform, as the integration with our environment uses this platform.",
                "severity": "High",
                "enabled": true,
                "query": "AADServicePrincipalSignInLogs\r\n| where TimeGenerated > ago(1d)\r\n//Modificar para CDU personalizados, donde el nombre no se puede modificar\r\n| where ServicePrincipalName == \"app-pid-pre-spn-xsoar-001\"\r\n| summarize\r\n    ['All Error Codes']=make_set(ResultType),\r\n    ['Successful IP Addresses']=make_set_if(IPAddress, ResultType == 0),\r\n    ['Failed IP Addresses']=make_set_if(IPAddress, ResultType == \"7000222\")\r\n    by ServicePrincipalId, ServicePrincipalName\r\n| where ['All Error Codes'] has_all (\"0\", \"7000222\")\r\n| project TargetAppId = ServicePrincipalId, TargetAppName = ServicePrincipalName, EventResult = ['All Error Codes'], EventFailedIp = ['Failed IP Addresses'], EventSuccessIp = ['Successful IP Addresses']",
                "queryFrequency": "PT1H",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "Persistence"
                ],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "AzureResource"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "AS-SNTL-040 Expired secret detected in XSOAR integration IN {{TargetAppName}}",
                    "alertDescriptionFormat": "Expired secret detected in {{TargetAppName}}. Failures since “{{EventFailedIp}}”.",
                    "alertDynamicProperties": []
                },
                "customDetails": {},
                "entityMappings": [
                    {
                        "entityType": "AzureResource",
                        "fieldMappings": [
                            {
                                "identifier": "ResourceId",
                                "columnName": "TargetAppId"
                            }
                        ]
                    },
                    {
                        "entityType": "CloudApplication",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "TargetAppName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}