{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e478ec09-12a0-4fcd-9ab4-c2e8a31da66a')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e478ec09-12a0-4fcd-9ab4-c2e8a31da66a')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "[SEGITTUR] TIP - Conexion entrante aceptada WAF contra IP",
                "description": "[SEGITTUR] TIP - Conexion entrante aceptada WAF contra IP",
                "severity": "High",
                "enabled": true,
                "query": "let ThreatIPs = ThreatIntelIndicators\n    | where isnotempty(ObservableValue)\n    | where IsDeleted == false\n    | where Confidence >= 80;\nAzureDiagnostics\n| where Category == \"FrontDoorWebApplicationFirewallLog\"\n| where ResourceType in (\"FRONTDOORS\", \"PROFILES\")\n| where action_s != \"Block\"\n| where requestUri_s contains \"pid.segittur\"\n| where isnotempty(clientIP_s)\n| join kind=inner (\nThreatIPs\n) on $left.clientIP_s == $right.ObservableValue\n| project TimeGenerated,\nclientIP_s,\nrequestUri_s,\naction_s,\nObservableValue,\nConfidence,\nResourceType,\nCreated,\nValidUntil\n",
                "queryFrequency": "PT5H",
                "queryPeriod": "P1D",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "InitialAccess",
                    "CommandAndControl"
                ],
                "techniques": [
                    "T1190",
                    "T1071"
                ],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "IP"
                        ],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "[SEGITTUR] TIP - Conexion entrante aceptada WAF contra IP {{clientIP_s}} ",
                    "alertDynamicProperties": []
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "clientIP_s"
                            }
                        ]
                    },
                    {
                        "entityType": "URL",
                        "fieldMappings": [
                            {
                                "identifier": "Url",
                                "columnName": "requestUri_s"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "ResourceType"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}