{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/13cba58e-2d7b-46d3-8f24-d6211b6f8066')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/13cba58e-2d7b-46d3-8f24-d6211b6f8066')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "[SEGITTUR] Alerta Defender for Cloud",
                "description": "[SEGITTUR] Alerta Defender for Cloud",
                "severity": "Medium",
                "enabled": true,
                "query": "SecurityAlert\n| where ProductName == \"Azure Security Center\"\n| extend Principal_IP_ = tostring(parse_json(ExtendedProperties).[\"Principal IP\"])\n| extend Malicious_URL_ = tostring(parse_json(ExtendedProperties).[\"Malicious URL\"])\n| where Malicious_URL_ !contains \"example.com\"\n| summarize\n    Message=make_set(ProviderName),\n    startTime=min(TimeGenerated),\n    endTime=max(TimeGenerated),\n    EventCount = count()\n    by AlertName, Principal_IP_\n\n",
                "queryFrequency": "PT10M",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "IP"
                        ],
                        "groupByAlertDetails": [
                            "DisplayName"
                        ],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "[SEGITTUR] Alerta Defender for Cloud {{AlertName}} desde {{Principal_IP_}} ",
                    "alertDescriptionFormat": "[SEGITTUR] Alerta Defender for Cloud {{AlertName}} desde {{Principal_IP_}} ",
                    "alertDynamicProperties": []
                },
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "CloudApplication",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "Message"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "Principal_IP_"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}