{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "apiVersion": "2023-02-01-preview",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'), '/Microsoft.SecurityInsights/Custom-SEGITTUR-Deteccion-posible-operacion-maliciosa-en-Key-Vault-AC07928B')]",
      "properties": {
        "displayName": "SEGITTUR Detección posible operacion maliciosa en Key Vault",
        "description": "[SEGITTUR] Detección posible operación maliciosa en Key Vault",
        "severity": "Medium",
        "enabled": true,
        "query": "let operationlist = dynamic(\n    [\"VaultDelete\", \"KeyDelete\", \"SecretDelete\", \"SecretPurge\", \"KeyPurge\", \"SecretBackup\", \"KeyBackup\", \"SecretListDeleted\", \"CertificateCreate\", \"CertificatePurge\"]);\nAzureDiagnostics\n| where ResourceType == \"VAULTS\" and ResultType == \"Success\" \n| where OperationName in (operationlist)\n| extend\n    JoinIP = tostring(split(CallerIPAddress, \":\")[0]),\n    User = coalesce(identity_claim_unique_name_s, identity_claim_upn_s)\n| join kind=leftouter (\n    DeviceNetworkInfo\n    | mv-expand IPAddresses\n    | extend JoinIP = tostring(IPAddresses.IPAddress)\n    | where isnotempty(JoinIP)\n    | project JoinIP, DeviceName\n) on JoinIP\n| project\n    TimeGenerated,\n    OperationName,\n    IpAddress=JoinIP,\n    User,\n    DeviceName,\n    KeyVaultName = Resource,\n    KeyVaultTarget = id_s,\n    ResourceGroup,\n    SubscriptionId",
        "queryFrequency": "PT5M",
        "queryPeriod": "PT5M",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "suppressionEnabled": false
      }
    }
  ]
}
