{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "apiVersion": "2023-02-01-preview",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'), '/Microsoft.SecurityInsights/Custom-SEGITTUR-TIP-Conexion-entrante-aceptada-WAF-contra-IP-208ECF9E')]",
      "properties": {
        "displayName": "SEGITTUR TIP - Conexion entrante aceptada WAF contra IP",
        "description": "[SEGITTUR] TIP - Conexion entrante aceptada WAF contra IP",
        "severity": "Medium",
        "enabled": true,
        "query": "let ThreatIPs = ThreatIntelIndicators\n| where isnotempty(ObservableValue)\n| where IsDeleted == false;\n//| where Confidence >= 20;\nAzureDiagnostics\n| where Category == \"FrontDoorWebApplicationFirewallLog\"\n| where ResourceType in (\"FRONTDOORS\", \"PROFILES\")\n| where action_s != \"Block\"\n| where requestUri_s contains \"pid.segittur\"\n| where isnotempty(clientIP_s)\n| join kind=inner (\n    ThreatIPs\n) on $left.clientIP_s == $right.ObservableValue\n| project TimeGenerated,\n          clientIP_s,\n          requestUri_s,\n          action_s,\n          ObservableValue,\n          Confidence,\n          ResourceType,\n          Created,\n          ValidUntil",
        "queryFrequency": "PT5M",
        "queryPeriod": "PT5M",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "suppressionEnabled": false
      }
    }
  ]
}
