{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/8346dd1e-9216-4641-afc2-d693474199a5')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/8346dd1e-9216-4641-afc2-d693474199a5')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "[TEST] Quantum Ramsonware detection",
                "description": "Use Case for monitoring typical movement of Quantum Ransomware.",
                "severity": "Medium",
                "enabled": true,
                "query": "DeviceFileEvents\r\n| where ActionType == \"FileRenamed\"\r\n| where PreviousFileName has_any ('.lnk', '.rtf', '.pst', '.docx', '.xlsx', '.jpg', '.jpeg', '.png', '.pdf')\r\n| where FileName endswith \".quantum\"\r\n| union (\r\n    DeviceRegistryEvents\r\n    | where ActionType == \"RegistryKeyCreated\"\r\n    | where RegistryKey contains \"HKEY_CURRENT_USER\\\\SOFTWARE\\\\Classes\\\\.quantum\\\\\"\r\n)",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [
                    "InitialAccess",
                    "CommandAndControl",
                    "PrivilegeEscalation",
                    "DefenseEvasion",
                    "Persistence"
                ],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": null,
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}