{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "string"
    }
  },
  "resources": [
    {
      "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
      "apiVersion": "2023-02-01-preview",
      "kind": "Scheduled",
      "name": "[concat(parameters('workspace'), '/Microsoft.SecurityInsights/Custom-TESTGEN-EF-O365-002-T1048-Massive-data-download-from-SharePointOneDrive-0225FA43')]",
      "properties": {
        "displayName": "TESTGEN EF-O365-002-T1048 Massive data download from SharePointOneDrive",
        "description": "Detects when a user performs a massive download of data from OneDrive and/or SharePoint, 1000 files in 10 minutes. Provides data on Country, Client IP, and all downloaded files.",
        "severity": "Medium",
        "enabled": true,
        "query": "let watchlist_EF_O365_002_T1048_User = (_GetWatchlist('watchlist_EF_O365_002_T1048_User') \n    | project SearchKey); \nlet watchlist_EF_O365_002_T1048_SourceIP = (_GetWatchlist('watchlist_EF_O365_002_T1048_SourceIP')\n    | project SearchKey); \nOfficeActivity \n| where OfficeWorkload in (\"SharePoint\", \"OneDrive\") \n| where Operation == \"FileDownloaded\" \n//| extend usuario = tostring(split(UserId,'@'))\n// Se excepciona sincronizaciones mismo usuario\n| extend user = replace_regex(UserId, \"[.@]\", \"_\")\n| where Site_Url !has user\n| where ClientIP !in (watchlist_EF_O365_002_T1048_SourceIP) \n| where UserId !in (watchlist_EF_O365_002_T1048_User) \n| extend location1=geo_info_from_ip_address(ClientIP)\n| extend Country = tostring(parse_json(tostring(location1)).country)\n| summarize dcount(OfficeObjectId) by UserId, OfficeWorkload, Site_Url \n| where dcount_OfficeObjectId > 500\n| join kind=inner (OfficeActivity \n    | where OfficeWorkload in (\"SharePoint\", \"OneDrive\") \n    | where Operation == \"FileDownloaded\" \n    | where ClientIP !in (watchlist_EF_O365_002_T1048_SourceIP) \n    | where UserId !in (watchlist_EF_O365_002_T1048_User)\n    | extend location1=geo_info_from_ip_address(ClientIP)\n    | extend Country = tostring(parse_json(tostring(location1)).country)\n    ) \n    on UserId \n| project \n    ActorUsername = UserId, \n    ActingAppName = OfficeWorkload, \n    TargetUrl = Site_Url, \n    Operation, \n    SrcIpAddr = ClientIP,\n    SrcGeoCountry = Country,\n    HttpUserAgent = UserAgent, \n    SrcFileName = SourceFileName, \n    EventCount = dcount_OfficeObjectId\n| parse ActorUsername with * \"urn:spo:\" UserUPN\n| extend User = iff(isempty(UserUPN), ActorUsername, UserUPN)\n| project-away UserUPN\n| summarize arg_max(TargetUrl,Operation,HttpUserAgent,SrcGeoCountry,EventCount),ListObject = make_set(SrcFileName) by ActorUsername, SrcIpAddr, ActingAppName",
        "queryFrequency": "PT5M",
        "queryPeriod": "PT5M",
        "triggerOperator": "GreaterThan",
        "triggerThreshold": 0,
        "suppressionEnabled": false
      }
    }
  ]
}
