{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/aa219a06-54f5-4f95-af63-0c8d6500895a')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/aa219a06-54f5-4f95-af63-0c8d6500895a')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2023-12-01-preview",
            "properties": {
                "displayName": "[TEST] Detecciones maliciosas APPLICATIONGATEWAYS",
                "description": "",
                "severity": "Medium",
                "enabled": true,
                "query": "let ThreatIPs = ThreatIntelIndicators\r\n| where Confidence >= 70\r\n| where isnotempty(ObservableValue)\r\n| summarize by ObservableValue;\r\nAzureDiagnostics\r\n| where ResourceType == \"APPLICATIONGATEWAYS\"\r\n| where Category == \"ApplicationGatewayFirewallLog\"\r\n| where TimeGenerated >= ago(24h)\r\n| where ruleSetType_s <> \"Microsoft_BotManagerRuleSet\"\r\n| where action_s != \"Blocked\"\r\n| where isnotempty(clientIp_s)\r\n| join kind=inner (\r\n    ThreatIPs\r\n) on $left.clientIp_s == $right.ObservableValue\r\n| project TimeGenerated,\r\n          clientIp_s,\r\n          action_s,\r\n          ruleId_s,\r\n          hostname_s,\r\n          ObservableValue",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT5H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [],
                "techniques": [],
                "subTechniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": null,
                "sentinelEntitiesMappings": null,
                "templateVersion": null
            }
        }
    ]
}