queryFrequency: PT5M
severity: Medium
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/845a5a1b-fe65-4e43-8ee2-578b1c9f275d')]"
queryPeriod: PT1H
triggerOperator: GreaterThan
tactics:
- PrivilegeEscalation
- DefenseEvasion
techniques: []
enabled: true
name: CNC0011 - Correlacion de Alertas M365D con actividad de red de dispositivo ajeno a Microsoft implicado en el inicio de sesion
triggerThreshold: 0
query: |+
  let Alert_List= dynamic([
      "Phishing link click observed in Network Traffic",
      "Phish delivered due to an IP allow policy",
      "A potentially malicious URL click was detected",
      "High Risk Sign-in Observed in Network Traffic",
      "A user clicked through to a potentially malicious URL",
      "Suspicious network connection to AitM phishing site",
      "Messages containing malicious entity not removed after delivery",
      "Email messages containing malicious URL removed after delivery",
      "Email reported by user as malware or phish",
      "Phish delivered due to an ETR override",
      "Phish not zapped because ZAP is disabled"]);
      SecurityAlert
      | where AlertName in~ (Alert_List)
      //Findling Alerts which has the URL
      | where Entities has "url"
      //extracting Entities
      | extend Entities = parse_json(Entities)
      | mv-apply Entity = Entities on
          (
          where Entity.Type == 'url'
          | extend EntityUrl = tostring(Entity.Url)
          )
      | summarize
          Url=tostring(tolower(take_any(EntityUrl))),
          AlertTime= min(TimeGenerated),
          make_set(SystemAlertId, 100)
          by ProductName, AlertName
      // matching with 3rd party network logs and 3p Alerts
      | join kind= inner (CommonSecurityLog
          | where DeviceVendor has_any  ("Palo Alto Networks", "Fortinet", "Check Point", "Zscaler")
          | where DeviceProduct startswith "FortiGate" or DeviceProduct startswith  "PAN" or DeviceProduct startswith  "VPN" or DeviceProduct startswith "FireWall" or DeviceProduct startswith  "NSSWeblog" or DeviceProduct startswith "URL"
          | where DeviceAction != "Block"
          | where isnotempty(RequestURL)
          | project
              3plogTime=TimeGenerated,
              DeviceVendor,
              DeviceProduct,
              Activity,
              DestinationHostName,
              DestinationIP,
              RequestURL=tostring(tolower(RequestURL)),
              MaliciousIP,
              SourceUserName=tostring(tolower(SourceUserName)),
              IndicatorThreatType,
              ThreatSeverity,
              ThreatConfidence,
              SourceUserID,
              SourceHostName)
          on $left.Url == $right.RequestURL
      // matching successful Login from suspicious IP
      | join kind=inner (SigninLogs
          //filtering the Successful Login
          | where ResultType == 0
          | project
              IPAddress,
              SourceSystem,
              SigniningTime= TimeGenerated,
              OperationName,
              ResultType,
              ResultDescription,
              AlternateSignInName,
              AppDisplayName,
              AuthenticationRequirement,
              ClientAppUsed,
              RiskState,
              RiskLevelDuringSignIn,
              UserPrincipalName=tostring(tolower(UserPrincipalName)),
              Name = tostring(split(UserPrincipalName, "@")[0]),
              UPNSuffix =tostring(split(UserPrincipalName, "@")[1]))
          on $left.DestinationIP == $right.IPAddress and $left.SourceUserName == $right.UserPrincipalName
      | where SigniningTime between ((AlertTime - 6h) .. (AlertTime + 6h)) and 3plogTime between ((AlertTime - 6h) .. (AlertTime + 6h))
description: Este contenido se utiliza para correlacionar las alertas relacionadas con el phishing de Microsoft Defender XDR. Se centra en los casos en los que un usuario se conecta correctamente a una URL de phishing desde un dispositivo de red que no es de Microsoft y, posteriormente, realiza intentos de inicio de sesión con éxito desde la dirección IP de phishing.

