severity: Low
description: Identifica los inicios de sesión fallidos de usuarios de gran volumen y el resultado debe analizarse para determinar si se trata de un ataque dirigido o simplemente de un error al introducir la contraseña.
enabled: true
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/d29c5946-1d10-45b1-bbb2-5a388032d7b5')]"
query: "SigninLogs\r\n| where ResultType == 50126\r\n| extend Country = tostring(LocationDetails[\"countryOrRegion\"])\r\n| project\r\n    TimeGenerated,\r\n    UserPrincipalName,\r\n    AppDisplayName,\r\n    IPAddress,\r\n    Country,\r\n    AuthenticationDetails,\r\n    DeviceDetail\r\n//| summarize by UserPrincipalName, IPAddress,AuthenticationDetails,Country\r\n| top 5 by UserPrincipalName\r\n| order by UserPrincipalName desc "
tactics:
- CredentialAccess
queryFrequency: PT5M
triggerOperator: GreaterThan
triggerThreshold: 200
queryPeriod: PT1H
name: COM0062 - Intentos de inicio de sesion fallidos detectados
techniques: []

