severity: High
description: |-
  PIM proporciona un mecanismo clave para asignar privilegios a las cuentas, esta consulta detecta cambios en la configuración de roles de PIM. Supervisa estos cambios para asegurarte de que se realizan de forma legítima y no confieren más privilegios de los esperados ni reducen la seguridad de una elevación de PIM.

  Referencia: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-privileged-accounts#changes-to-privileged-accounts
enabled: true
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/28404bd4-4293-4b86-af05-9c5148b92dc3')]"
query: |2+
   AuditLogs
      | where Category =~ "RoleManagement"
      | where OperationName =~ "Update role setting in PIM"
      | extend InitiatingUserPrincipalName = tostring(InitiatedBy.user.userPrincipalName)
      | extend InitiatingAadUserId = tostring(InitiatedBy.user.id)
      | extend InitiatingIPAddress = tostring(InitiatedBy.user.ipAddress)
      | extend InitiatingAccountName = tostring(split(InitiatingUserPrincipalName, "@")[0]), InitiatingAccountUPNSuffix = tostring(split(InitiatingUserPrincipalName, "@")[1])
      | project-reorder TimeGenerated, OperationName, ResultReason, InitiatingUserPrincipalName, InitiatingAadUserId, InitiatingIPAddress, InitiatingAccountName, InitiatingAccountUPNSuffix
tactics:
- PrivilegeEscalation
queryFrequency: PT5M
triggerOperator: GreaterThan
triggerThreshold: 0
queryPeriod: PT1H
name: COM0064 - Cambios en la configuracion de Privileged Identity Management (PIM)
techniques: []

