severity: Low
description: Identifica y supervisa actividades críticas relacionadas con grupos y usuarios en Azure Active Directory. En concreto, se centra en detectar eventos como la adición o eliminación de miembros de grupos, las modificaciones de cuentas de usuario y la eliminación de usuarios.
enabled: true
id: "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/f8443caf-2fd4-41a1-be33-d3fb2dff0504')]"
query: |+
  let TimeWindow   = 1h;   // Ventana de detección (última hora)
  let MinOps       = 5;    // Mínimo de operaciones totales para considerarlo sospechoso
  let MinTargets   = 3;    // Mínimo de usuarios distintos afectados
  let CurrentEvents = AuditLogs
      | where TimeGenerated between (ago(TimeWindow) .. now())
      | where ActivityDisplayName in (
          "Add member to group",         // Añadir miembro a un grupo
          "Remove member from group",    // Eliminar miembro de un grupo
          "Delete user",                 // Eliminar usuario
          "Update user"                  // Modificar usuario
          )
      //| where InitiatedBy !contains "pidpia"
      | extend
          UserPrincipalName = tostring(InitiatedBy.user.userPrincipalName), // quien hace la acción
          TargetUserName = tostring(TargetResources[0].userPrincipalName) // Usuario afectado
      | where isnotempty(UserPrincipalName) and isnotempty(TargetUserName);
  // usuarios sospechosos  detectando muchos cambios sobre varios usuarios
  let SuspiciousUsers = CurrentEvents
      | summarize 
          OperationsCount = count(), // num. total de acciones
          DistinctTargets = dcount(TargetUserName), // num. de usuarios distintos afectados
          Actions = make_set(ActivityDisplayName)
          by UserPrincipalName
      | where OperationsCount >= MinOps and DistinctTargets >= MinTargets;
  // Devolvemos el detalle de las acciones de esos usuarios sospechosos
  SuspiciousUsers
  | join kind=inner (CurrentEvents) on UserPrincipalName
  | project 
      TimeGenerated,     // Hora del evento
      UserPrincipalName, // Usuario sospechoso que inició la acción
      ActivityDisplayName,                  // Tipo de actividad
      TargetUserName,  // Usuario o recurso afectado
      Identity,                             // Identidad asociada con la acción
      ResultDescription,                    // Descripción del resultado de la operación
      Category,                             // Categoría del evento
      AADOperationType,                     // Tipo de operación en Azure AD
      InitiatedBy,                          // Información sobre quién inició la acción
      LoggedByService                       // Servicio que registró la acción
  | order by TimeGenerated desc             // Ordenar por tiempo en orden descendente

tactics:
- Persistence
- CommandAndControl
- Exfiltration
queryFrequency: PT1H
triggerOperator: GreaterThan
triggerThreshold: 5
queryPeriod: PT5H
name: DEL0046 - Actividad inesperada de usuario de Directorio Activo de Azure
techniques: []

